## Setup technology files
include ../Scripts/X-FAB_typ
## Setup variables
set DESIGN FDHT
set PARAMS {}
## Read in Verilog HDL files
# Top module
read_hdl -v2001 ../Source/FDHT/FDHT.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication1_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication2_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication3_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication4.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication5.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication6.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication7.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication8.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication9.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication4_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication5_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication6_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication7_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication8_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication9_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block30.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block31.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block32.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block33.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block34.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block35.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block36.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block37.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block38.v
read_hdl -v2001 ../Source/FDHT/Complex_multiplication_block39.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block30.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block31.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block32.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum1_block33.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block30.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block31.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block32.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum2_block33.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block30.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block31.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block32.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum3_block33.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block1.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block2.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block3.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block4.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block5.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block6.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block7.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block8.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block9.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block10.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block11.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block12.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block13.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block14.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block15.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block16.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block17.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block18.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block19.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block20.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block21.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block22.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block23.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block24.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block25.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block26.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block27.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block28.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block29.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block30.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block31.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block32.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block33.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block34.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block35.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block36.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block37.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block38.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block39.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block40.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block41.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block42.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block43.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block44.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block45.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block46.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block47.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block48.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block49.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block50.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block51.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block52.v
read_hdl -v2001 ../Source/FDHT/Complex_Sum_block53.v
read_hdl -v2001 ../Source/FDHT/complex_to_real_imag_DFT50.v
read_hdl -v2001 ../Source/FDHT/DFT.v
read_hdl -v2001 ../Source/FDHT/DFT2_1.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block1.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block2.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block3.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block4.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block5.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block6.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block7.v
read_hdl -v2001 ../Source/FDHT/DFT2_1_block8.v
read_hdl -v2001 ../Source/FDHT/DFT2_2.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block1.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block2.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block3.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block4.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block5.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block6.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block7.v
read_hdl -v2001 ../Source/FDHT/DFT2_2_block8.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_1.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_1_block.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_2.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_2_block.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_3.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_3_block.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_4.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_4_block.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_5.v
read_hdl -v2001 ../Source/FDHT/DFT2_column_5_block.v
read_hdl -v2001 ../Source/FDHT/DFT5.v
read_hdl -v2001 ../Source/FDHT/DFT5_1.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block1.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block2.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block3.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block4.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block5.v
read_hdl -v2001 ../Source/FDHT/DFT5_1_block6.v
read_hdl -v2001 ../Source/FDHT/DFT5_2.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block1.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block2.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block3.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block4.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block5.v
read_hdl -v2001 ../Source/FDHT/DFT5_2_block6.v
read_hdl -v2001 ../Source/FDHT/DFT5_3.v
read_hdl -v2001 ../Source/FDHT/DFT5_3_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_3_block1.v
read_hdl -v2001 ../Source/FDHT/DFT5_3_block2.v
read_hdl -v2001 ../Source/FDHT/DFT5_3_block3.v
read_hdl -v2001 ../Source/FDHT/DFT5_3_block4.v
read_hdl -v2001 ../Source/FDHT/DFT5_3_block5.v
read_hdl -v2001 ../Source/FDHT/DFT5_4.v
read_hdl -v2001 ../Source/FDHT/DFT5_4_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_4_block1.v
read_hdl -v2001 ../Source/FDHT/DFT5_4_block2.v
read_hdl -v2001 ../Source/FDHT/DFT5_4_block3.v
read_hdl -v2001 ../Source/FDHT/DFT5_4_block4.v
read_hdl -v2001 ../Source/FDHT/DFT5_5.v
read_hdl -v2001 ../Source/FDHT/DFT5_5_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_5_block1.v
read_hdl -v2001 ../Source/FDHT/DFT5_5_block2.v
read_hdl -v2001 ../Source/FDHT/DFT5_5_block3.v
read_hdl -v2001 ../Source/FDHT/DFT5_5_block4.v
read_hdl -v2001 ../Source/FDHT/DFT5_block_IDFT.v
read_hdl -v2001 ../Source/FDHT/DFT5_column_1.v
read_hdl -v2001 ../Source/FDHT/DFT5_column_1_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_column_2.v
read_hdl -v2001 ../Source/FDHT/DFT5_column_2_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_row_1.v
read_hdl -v2001 ../Source/FDHT/DFT5_row_1_block.v
read_hdl -v2001 ../Source/FDHT/DFT5_row_2.v
read_hdl -v2001 ../Source/FDHT/DFT5_row_2_block.v
read_hdl -v2001 ../Source/FDHT/DFT10_block.v
read_hdl -v2001 ../Source/FDHT/DFT10_block_2.v
read_hdl -v2001 ../Source/FDHT/DFT_2.v
read_hdl -v2001 ../Source/FDHT/generating_analytical_spectrum.v
read_hdl -v2001 ../Source/FDHT/mem1.v
read_hdl -v2001 ../Source/FDHT/mem1_block.v
read_hdl -v2001 ../Source/FDHT/mem1_block2.v
read_hdl -v2001 ../Source/FDHT/mem1_block3.v
read_hdl -v2001 ../Source/FDHT/mem1_block4.v
read_hdl -v2001 ../Source/FDHT/mem1_block5.v
read_hdl -v2001 ../Source/FDHT/mem1_block6.v
read_hdl -v2001 ../Source/FDHT/mem1_block7.v
read_hdl -v2001 ../Source/FDHT/mem1_block8.v
read_hdl -v2001 ../Source/FDHT/mem1_block9.v
read_hdl -v2001 ../Source/FDHT/mem2.v
read_hdl -v2001 ../Source/FDHT/mem2_block.v
read_hdl -v2001 ../Source/FDHT/mem2_block1.v
read_hdl -v2001 ../Source/FDHT/mem2_block3.v
read_hdl -v2001 ../Source/FDHT/mem2_block4.v
read_hdl -v2001 ../Source/FDHT/mem2_block5.v
read_hdl -v2001 ../Source/FDHT/mem2_block6.v
read_hdl -v2001 ../Source/FDHT/mem2_block7.v
read_hdl -v2001 ../Source/FDHT/mem2_block8.v
read_hdl -v2001 ../Source/FDHT/mem2_block9.v
read_hdl -v2001 ../Source/FDHT/mem3.v
read_hdl -v2001 ../Source/FDHT/mem3_block.v
read_hdl -v2001 ../Source/FDHT/mem3_block1.v
read_hdl -v2001 ../Source/FDHT/mem3_block2.v
read_hdl -v2001 ../Source/FDHT/mem3_block4.v
read_hdl -v2001 ../Source/FDHT/mem3_block5.v
read_hdl -v2001 ../Source/FDHT/mem3_block6.v
read_hdl -v2001 ../Source/FDHT/mem3_block7.v
read_hdl -v2001 ../Source/FDHT/mem3_block8.v
read_hdl -v2001 ../Source/FDHT/mem3_block9.v
read_hdl -v2001 ../Source/FDHT/mem4.v
read_hdl -v2001 ../Source/FDHT/mem4_block.v
read_hdl -v2001 ../Source/FDHT/mem4_block1.v
read_hdl -v2001 ../Source/FDHT/mem4_block2.v
read_hdl -v2001 ../Source/FDHT/mem4_block3.v
read_hdl -v2001 ../Source/FDHT/mem4_block5.v
read_hdl -v2001 ../Source/FDHT/mem4_block6.v
read_hdl -v2001 ../Source/FDHT/mem4_block7.v
read_hdl -v2001 ../Source/FDHT/mem4_block8.v
read_hdl -v2001 ../Source/FDHT/mem4_block9.v
read_hdl -v2001 ../Source/FDHT/mem5.v
read_hdl -v2001 ../Source/FDHT/mem5_block.v
read_hdl -v2001 ../Source/FDHT/mem5_block1.v
read_hdl -v2001 ../Source/FDHT/mem5_block2.v
read_hdl -v2001 ../Source/FDHT/mem5_block3.v
read_hdl -v2001 ../Source/FDHT/mem5_block4.v
read_hdl -v2001 ../Source/FDHT/mem5_block6.v
read_hdl -v2001 ../Source/FDHT/mem5_block7.v
read_hdl -v2001 ../Source/FDHT/mem5_block8.v
read_hdl -v2001 ../Source/FDHT/mem5_block9.v
read_hdl -v2001 ../Source/FDHT/Mem.v
read_hdl -v2001 ../Source/FDHT/Mem1_block1.v
read_hdl -v2001 ../Source/FDHT/Mem2_block2.v
read_hdl -v2001 ../Source/FDHT/Mem3_block3.v
read_hdl -v2001 ../Source/FDHT/Mem4_block4.v
read_hdl -v2001 ../Source/FDHT/Mem5_block5.v
read_hdl -v2001 ../Source/FDHT/Mem6.v
read_hdl -v2001 ../Source/FDHT/Mem7.v
read_hdl -v2001 ../Source/FDHT/Mem8.v
read_hdl -v2001 ../Source/FDHT/Mem9.v
read_hdl -v2001 ../Source/FDHT/Memory_first_data.v
read_hdl -v2001 ../Source/FDHT/parallel_serial.v
read_hdl -v2001 ../Source/FDHT/Real_imag_to_DFT50.v
read_hdl -v2001 ../Source/FDHT/Save_data_G.v
read_hdl -v2001 ../Source/FDHT/save_DFT50_swapping_values.v
read_hdl -v2001 ../Source/FDHT/save_G_values.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_0.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_1.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_2.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_3.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_4.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_5.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_6.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_7.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_8.v
read_hdl -v2001 ../Source/FDHT/save_values_im_G_x_9.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_1.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_2.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_3.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_4.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_5.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_6.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_7.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_8.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_9.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_10.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_11.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_12.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_13.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_14.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_15.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_16.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_17.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_18.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_19.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_0_block.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_1.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_2.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_3.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_4.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_5.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_6.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_7.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_8.v
read_hdl -v2001 ../Source/FDHT/save_values_real_G_x_9.v
read_hdl -v2001 ../Source/FDHT/serial_parallel.v
read_hdl -v2001 ../Source/FDHT/SinglePortRAM_generic.v
read_hdl -v2001 ../Source/FDHT/Subsystem1.v
read_hdl -v2001 ../Source/FDHT/Subsystem1_block.v
read_hdl -v2001 ../Source/FDHT/Subsystem2.v
read_hdl -v2001 ../Source/FDHT/Subsystem2_block.v
read_hdl -v2001 ../Source/FDHT/Subsystem2_block1.v
read_hdl -v2001 ../Source/FDHT/Subsystem2_block2.v
read_hdl -v2001 ../Source/FDHT/Subsystem3.v
read_hdl -v2001 ../Source/FDHT/Subsystem3_block.v
read_hdl -v2001 ../Source/FDHT/Subsystem3_block1.v
read_hdl -v2001 ../Source/FDHT/Subsystem3_block2.v
read_hdl -v2001 ../Source/FDHT/Subsystem4.v
read_hdl -v2001 ../Source/FDHT/Subsystem4_block.v
read_hdl -v2001 ../Source/FDHT/Subsystem4_block1.v
read_hdl -v2001 ../Source/FDHT/Subsystem4_block2.v
read_hdl -v2001 ../Source/FDHT/Subsystem5.v
read_hdl -v2001 ../Source/FDHT/Subsystem5_block.v
read_hdl -v2001 ../Source/FDHT/Subsystem5_block1.v
read_hdl -v2001 ../Source/FDHT/Subsystem5_block2.v
read_hdl -v2001 ../Source/FDHT/Subsystem6.v
read_hdl -v2001 ../Source/FDHT/Subsystem6_block.v
read_hdl -v2001 ../Source/FDHT/Subsystem8.v
read_hdl -v2001 ../Source/FDHT/Subsystem9.v
read_hdl -v2001 ../Source/FDHT/Subsystem10.v
read_hdl -v2001 ../Source/FDHT/Subsystem11.v
read_hdl -v2001 ../Source/FDHT/Swapping.v
read_hdl -v2001 ../Source/FDHT/switching_data_DFT_10.v
read_hdl -v2001 ../Source/FDHT/switching_DFT50_swapping_values.v
read_hdl -v2001 ../Source/FDHT/Switching_DFT50.v
read_hdl -v2001 ../Source/FDHT/switching_G.v
read_hdl -v2001 ../Source/FDHT/switching_G2.v
read_hdl -v2001 ../Source/FDHT/switching_G_values1.v
read_hdl -v2001 ../Source/FDHT/switching_G_values2.v
read_hdl -v2001 ../Source/FDHT/taking_imaginary_part.v
read_hdl -v2001 ../Source/FDHT/W10.v
read_hdl -v2001 ../Source/FDHT/W10_block.v
read_hdl -v2001 ../Source/FDHT/W50.v
read_hdl -v2001 ../Source/FDHT/W50_block.v

## Compile our code (create a technology-independent schematic)
elaborate -parameters $PARAMS $DESIGN
## Setup design constraints
read_sdc ../Source/FDHT.sdc
## Synthesize our schematic (create a technology-dependent schematic)
#synthesize -to_generic
synthesize -to_mapped
synthesize -incremental
## Write out area and timing reports
report area > ../Reports/Top_synth_area_report_DFHT_typ
report timing > ../Reports/Top_synth_timing_report_DFHT_typ
## Write out synthesized Verilog netlist
write_hdl -mapped > ../Source/FDHT_synth_typ.v
## Write out the SDC file we will take into the place n route tool
write_sdc > ../Source/hilbert_out_typ.sdc
gui_show

